In [2]:
import pandas as pd
import numpy as np

# Series
one-dimensional

In [3]:
s = pd.Series([1,2,3,4,np.nan])
s

0    1.0
1    2.0
2    3.0
3    4.0
4    NaN
dtype: float64

In [4]:
dates = pd.date_range('20180213', periods=7)
dates

DatetimeIndex(['2018-02-13', '2018-02-14', '2018-02-15', '2018-02-16',
               '2018-02-17', '2018-02-18', '2018-02-19'],
              dtype='datetime64[ns]', freq='D')

 # DataFrame
 two-dimensional

In [7]:
df = pd.DataFrame(np.random.randn(7,4), index=dates, columns=['A', 'B', 'C', 'D'])
df

                   A         B         C         D
2018-02-13  1.314583 -0.796022 -1.045282 -0.582569
2018-02-14 -0.494383 -1.812418  0.392011  2.177406
2018-02-15  2.160203  0.349930 -1.613977 -0.993914
2018-02-16 -1.018225  0.629277 -1.888395 -0.757447
2018-02-17 -1.096299  2.092237  0.280251  0.292239
2018-02-18  0.513296 -0.625118  0.000796 -0.366454
2018-02-19 -1.349954  0.638369 -0.632032 -0.979503

In [11]:
df2 = pd.DataFrame({'A':1,
                    'B': pd.Timestamp('20180213'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3]*4, dtype='int32'),
                    'E': pd.Categorical(['test', 'train', 'test', 'train']),
                    'F': 'foo'
                   })
print(df2)
print('\n')
print(df2.dtypes)

   A          B    C  D      E    F
0  1 2018-02-13  1.0  3   test  foo
1  1 2018-02-13  1.0  3  train  foo
2  1 2018-02-13  1.0  3   test  foo
3  1 2018-02-13  1.0  3  train  foo


A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

# Data Selection

dataframe.head(n)  -> First 'n' rows by default 5

In [13]:
df.head()

                   A         B         C         D
2018-02-13  1.314583 -0.796022 -1.045282 -0.582569
2018-02-14 -0.494383 -1.812418  0.392011  2.177406
2018-02-15  2.160203  0.349930 -1.613977 -0.993914
2018-02-16 -1.018225  0.629277 -1.888395 -0.757447
2018-02-17 -1.096299  2.092237  0.280251  0.292239

dataframe.tail(n)  ->  Last 'n' rows by default 5

In [14]:
df.tail()

                   A         B         C         D
2018-02-15  2.160203  0.349930 -1.613977 -0.993914
2018-02-16 -1.018225  0.629277 -1.888395 -0.757447
2018-02-17 -1.096299  2.092237  0.280251  0.292239
2018-02-18  0.513296 -0.625118  0.000796 -0.366454
2018-02-19 -1.349954  0.638369 -0.632032 -0.979503

In [15]:
df.index

DatetimeIndex(['2018-02-13', '2018-02-14', '2018-02-15', '2018-02-16',
               '2018-02-17', '2018-02-18', '2018-02-19'],
              dtype='datetime64[ns]', freq='D')

In [16]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [17]:
df.values

array([[  1.31458335e+00,  -7.96022022e-01,  -1.04528191e+00,
         -5.82569428e-01],
       [ -4.94383261e-01,  -1.81241825e+00,   3.92010837e-01,
          2.17740633e+00],
       [  2.16020318e+00,   3.49930076e-01,  -1.61397728e+00,
         -9.93914060e-01],
       [ -1.01822497e+00,   6.29276678e-01,  -1.88839466e+00,
         -7.57446796e-01],
       [ -1.09629906e+00,   2.09223691e+00,   2.80251421e-01,
          2.92238816e-01],
       [  5.13296243e-01,  -6.25117975e-01,   7.96381790e-04,
         -3.66454080e-01],
       [ -1.34995437e+00,   6.38368665e-01,  -6.32031914e-01,
         -9.79503349e-01]])

dataframe.describe() gives the summary of whole dataframe

In [18]:
df.describe()

              A         B         C         D
count  7.000000  7.000000  7.000000  7.000000
mean   0.004174  0.068036 -0.643804 -0.172892
std    1.351752  1.263612  0.912311  1.126348
min   -1.349954 -1.812418 -1.888395 -0.993914
25%   -1.057262 -0.710570 -1.329630 -0.868475
50%   -0.494383  0.349930 -0.632032 -0.582569
75%    0.913940  0.633823  0.140524 -0.037108
max    2.160203  2.092237  0.392011  2.177406

Transpose the dataframe where index will become column names and column names as index

In [20]:
print('Dataframe before transpose:\n', df)
print('\nDataframe after transpose\n', df.T)

Dataframe before transpose:
                    A         B         C         D
2018-02-13  1.314583 -0.796022 -1.045282 -0.582569
2018-02-14 -0.494383 -1.812418  0.392011  2.177406
2018-02-15  2.160203  0.349930 -1.613977 -0.993914
2018-02-16 -1.018225  0.629277 -1.888395 -0.757447
2018-02-17 -1.096299  2.092237  0.280251  0.292239
2018-02-18  0.513296 -0.625118  0.000796 -0.366454
2018-02-19 -1.349954  0.638369 -0.632032 -0.979503

Dataframe after transpose
    2018-02-13  2018-02-14  2018-02-15  2018-02-16  2018-02-17  2018-02-18  \
A    1.314583   -0.494383    2.160203   -1.018225   -1.096299    0.513296
B   -0.796022   -1.812418    0.349930    0.629277    2.092237   -0.625118
C   -1.045282    0.392011   -1.613977   -1.888395    0.280251    0.000796
D   -0.582569    2.177406   -0.993914   -0.757447    0.292239   -0.366454

   2018-02-19
A   -1.349954
B    0.638369
C   -0.632032
D   -0.979503

Sort the values

In [21]:
df.sort_values(by='B')

                   A         B         C         D
2018-02-14 -0.494383 -1.812418  0.392011  2.177406
2018-02-13  1.314583 -0.796022 -1.045282 -0.582569
2018-02-18  0.513296 -0.625118  0.000796 -0.366454
2018-02-15  2.160203  0.349930 -1.613977 -0.993914
2018-02-16 -1.018225  0.629277 -1.888395 -0.757447
2018-02-19 -1.349954  0.638369 -0.632032 -0.979503
2018-02-17 -1.096299  2.092237  0.280251  0.292239

Selecting a particular column

In [22]:
df['C']

2018-02-13   -1.045282
2018-02-14    0.392011
2018-02-15   -1.613977
2018-02-16   -1.888395
2018-02-17    0.280251
2018-02-18    0.000796
2018-02-19   -0.632032
Freq: D, Name: C, dtype: float64

Slice

In [23]:
df[0:3]

                   A         B         C         D
2018-02-13  1.314583 -0.796022 -1.045282 -0.582569
2018-02-14 -0.494383 -1.812418  0.392011  2.177406
2018-02-15  2.160203  0.349930 -1.613977 -0.993914

In [24]:
df['2018-02-15':'2018-02-19']

                   A         B         C         D
2018-02-15  2.160203  0.349930 -1.613977 -0.993914
2018-02-16 -1.018225  0.629277 -1.888395 -0.757447
2018-02-17 -1.096299  2.092237  0.280251  0.292239
2018-02-18  0.513296 -0.625118  0.000796 -0.366454
2018-02-19 -1.349954  0.638369 -0.632032 -0.979503

Selecting using label

In [25]:
df.loc[dates[0]]

A    1.314583
B   -0.796022
C   -1.045282
D   -0.582569
Name: 2018-02-13 00:00:00, dtype: float64

In [27]:
df.loc[:, ['A', 'B']]

                   A         B
2018-02-13  1.314583 -0.796022
2018-02-14 -0.494383 -1.812418
2018-02-15  2.160203  0.349930
2018-02-16 -1.018225  0.629277
2018-02-17 -1.096299  2.092237
2018-02-18  0.513296 -0.625118
2018-02-19 -1.349954  0.638369

In [29]:
df.loc['2018-02-15':'2018-02-18', ['A', 'B','D']]

                   A         B         D
2018-02-15  2.160203  0.349930 -0.993914
2018-02-16 -1.018225  0.629277 -0.757447
2018-02-17 -1.096299  2.092237  0.292239
2018-02-18  0.513296 -0.625118 -0.366454

In [30]:
df

                   A         B         C         D
2018-02-13  1.314583 -0.796022 -1.045282 -0.582569
2018-02-14 -0.494383 -1.812418  0.392011  2.177406
2018-02-15  2.160203  0.349930 -1.613977 -0.993914
2018-02-16 -1.018225  0.629277 -1.888395 -0.757447
2018-02-17 -1.096299  2.092237  0.280251  0.292239
2018-02-18  0.513296 -0.625118  0.000796 -0.366454
2018-02-19 -1.349954  0.638369 -0.632032 -0.979503

In [31]:
df.loc[dates[0], 'A']

1.3145833458901006

Selection by position -> df.iloc[]

In [33]:
df.iloc[3]    # Fourth row od dataframe

A   -1.018225
B    0.629277
C   -1.888395
D   -0.757447
Name: 2018-02-16 00:00:00, dtype: float64

In [34]:
df.iloc[3:5, 1:4]

                   B         C         D
2018-02-16  0.629277 -1.888395 -0.757447
2018-02-17  2.092237  0.280251  0.292239

In [36]:
df.iloc[[1,2,5],[2,3]]

                   C         D
2018-02-14  0.392011  2.177406
2018-02-15 -1.613977 -0.993914
2018-02-18  0.000796 -0.366454

In [38]:
df.iloc[1:3, :]

                   A         B         C         D
2018-02-14 -0.494383 -1.812418  0.392011  2.177406
2018-02-15  2.160203  0.349930 -1.613977 -0.993914

In [39]:
df.iloc[:, 1:3]

                   B         C
2018-02-13 -0.796022 -1.045282
2018-02-14 -1.812418  0.392011
2018-02-15  0.349930 -1.613977
2018-02-16  0.629277 -1.888395
2018-02-17  2.092237  0.280251
2018-02-18 -0.625118  0.000796
2018-02-19  0.638369 -0.632032

In [40]:
df.iloc[2,2]

-1.6139772794553513

Boolean Indexing

In [42]:
df[df>-1]

                   A         B         C         D
2018-02-13  1.314583 -0.796022       NaN -0.582569
2018-02-14 -0.494383       NaN  0.392011  2.177406
2018-02-15  2.160203  0.349930       NaN -0.993914
2018-02-16       NaN  0.629277       NaN -0.757447
2018-02-17       NaN  2.092237  0.280251  0.292239
2018-02-18  0.513296 -0.625118  0.000796 -0.366454
2018-02-19       NaN  0.638369 -0.632032 -0.979503

For filtering the values we can use 'isin()'.

In [46]:
df2 = df.copy()
df2['E'] = ['one', 'two', 'three', 'one', 'two', 'four', 'two']
df2

                   A         B         C         D      E
2018-02-13  1.314583 -0.796022 -1.045282 -0.582569    one
2018-02-14 -0.494383 -1.812418  0.392011  2.177406    two
2018-02-15  2.160203  0.349930 -1.613977 -0.993914  three
2018-02-16 -1.018225  0.629277 -1.888395 -0.757447    one
2018-02-17 -1.096299  2.092237  0.280251  0.292239    two
2018-02-18  0.513296 -0.625118  0.000796 -0.366454   four
2018-02-19 -1.349954  0.638369 -0.632032 -0.979503    two

In [48]:
df2[df2['E'].isin(['one',  'two'])]

                   A         B         C         D    E
2018-02-13  1.314583 -0.796022 -1.045282 -0.582569  one
2018-02-14 -0.494383 -1.812418  0.392011  2.177406  two
2018-02-16 -1.018225  0.629277 -1.888395 -0.757447  one
2018-02-17 -1.096299  2.092237  0.280251  0.292239  two
2018-02-19 -1.349954  0.638369 -0.632032 -0.979503  two

In [51]:
s1 = pd.Series([1,2,3,4,5,6,7], index=pd.date_range('2018-02-13', periods=7))
s1

2018-02-13    1
2018-02-14    2
2018-02-15    3
2018-02-16    4
2018-02-17    5
2018-02-18    6
2018-02-19    7
Freq: D, dtype: int64

In [54]:
df['E'] = s1
df

                   A         B         C         D  E
2018-02-13  1.314583 -0.796022 -1.045282 -0.582569  1
2018-02-14 -0.494383 -1.812418  0.392011  2.177406  2
2018-02-15  2.160203  0.349930 -1.613977 -0.993914  3
2018-02-16 -1.018225  0.629277 -1.888395 -0.757447  4
2018-02-17 -1.096299  2.092237  0.280251  0.292239  5
2018-02-18  0.513296 -0.625118  0.000796 -0.366454  6
2018-02-19 -1.349954  0.638369 -0.632032 -0.979503  7

In [57]:
df.at[dates[0], 'A'] = 0
df

                   A         B         C         D  E
2018-02-13  0.000000 -0.796022 -1.045282 -0.582569  1
2018-02-14 -0.494383 -1.812418  0.392011  2.177406  2
2018-02-15  2.160203  0.349930 -1.613977 -0.993914  3
2018-02-16 -1.018225  0.629277 -1.888395 -0.757447  4
2018-02-17 -1.096299  2.092237  0.280251  0.292239  5
2018-02-18  0.513296 -0.625118  0.000796 -0.366454  6
2018-02-19 -1.349954  0.638369 -0.632032 -0.979503  7

In [59]:
df.iat[0,1] = 1
df

                   A         B         C         D  E
2018-02-13  0.000000  1.000000 -1.045282 -0.582569  1
2018-02-14 -0.494383 -1.812418  0.392011  2.177406  2
2018-02-15  2.160203  0.349930 -1.613977 -0.993914  3
2018-02-16 -1.018225  0.629277 -1.888395 -0.757447  4
2018-02-17 -1.096299  2.092237  0.280251  0.292239  5
2018-02-18  0.513296 -0.625118  0.000796 -0.366454  6
2018-02-19 -1.349954  0.638369 -0.632032 -0.979503  7

In [61]:
df.loc[:, 'D'] = np.array([5]*len(df))
df

                   A         B         C  D  E
2018-02-13  0.000000  1.000000 -1.045282  5  1
2018-02-14 -0.494383 -1.812418  0.392011  5  2
2018-02-15  2.160203  0.349930 -1.613977  5  3
2018-02-16 -1.018225  0.629277 -1.888395  5  4
2018-02-17 -1.096299  2.092237  0.280251  5  5
2018-02-18  0.513296 -0.625118  0.000796  5  6
2018-02-19 -1.349954  0.638369 -0.632032  5  7

# Missing Data

In [68]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns)+['F'])
df1

                   A         B         C  D  E   F
2018-02-13  0.000000  1.000000 -1.045282  5  1 NaN
2018-02-14 -0.494383 -1.812418  0.392011  5  2 NaN
2018-02-15  2.160203  0.349930 -1.613977  5  3 NaN
2018-02-16 -1.018225  0.629277 -1.888395  5  4 NaN

In [77]:
df1.loc[dates[0]:dates[1], 'F'] = 10
df1

                   A         B         C  D  E     F
2018-02-13  0.000000  1.000000 -1.045282  5  1  10.0
2018-02-14 -0.494383 -1.812418  0.392011  5  2  10.0
2018-02-15  2.160203  0.349930 -1.613977  5  3   NaN
2018-02-16 -1.018225  0.629277 -1.888395  5  4   NaN

Using 'dropna()' drop the rows having nan values

In [82]:
df1.dropna(how='any')

                   A         B         C  D  E     F
2018-02-13  0.000000  1.000000 -1.045282  5  1  10.0
2018-02-14 -0.494383 -1.812418  0.392011  5  2  10.0

In [83]:
df1.fillna(5)

                   A         B         C  D  E     F
2018-02-13  0.000000  1.000000 -1.045282  5  1  10.0
2018-02-14 -0.494383 -1.812418  0.392011  5  2  10.0
2018-02-15  2.160203  0.349930 -1.613977  5  3   5.0
2018-02-16 -1.018225  0.629277 -1.888395  5  4   5.0

In [84]:
df1.isnull()

                A      B      C      D      E      F
2018-02-13  False  False  False  False  False  False
2018-02-14  False  False  False  False  False  False
2018-02-15  False  False  False  False  False   True
2018-02-16  False  False  False  False  False   True

# Stats

In [85]:
df

                   A         B         C  D  E
2018-02-13  0.000000  1.000000 -1.045282  5  1
2018-02-14 -0.494383 -1.812418  0.392011  5  2
2018-02-15  2.160203  0.349930 -1.613977  5  3
2018-02-16 -1.018225  0.629277 -1.888395  5  4
2018-02-17 -1.096299  2.092237  0.280251  5  5
2018-02-18  0.513296 -0.625118  0.000796  5  6
2018-02-19 -1.349954  0.638369 -0.632032  5  7

In [86]:
df.mean()

A   -0.183623
B    0.324611
C   -0.643804
D    5.000000
E    4.000000
dtype: float64

In [89]:
df.mean(axis=1)    # Column-wise

2018-02-13    1.190944
2018-02-14    1.017042
2018-02-15    1.779231
2018-02-16    1.344531
2018-02-17    2.255238
2018-02-18    2.177795
2018-02-19    2.131276
Freq: D, dtype: float64

In [87]:
df.sum()

A    -1.285362
B     2.272276
C    -4.506627
D    35.000000
E    28.000000
dtype: float64

In [91]:
s = pd.Series([1,2,3,np.nan,np.nan,6,7], index=dates).shift(2)
s

2018-02-13    NaN
2018-02-14    NaN
2018-02-15    1.0
2018-02-16    2.0
2018-02-17    3.0
2018-02-18    NaN
2018-02-19    NaN
Freq: D, dtype: float64

In [93]:
df.sub(s, axis='index')

                   A         B         C    D    E
2018-02-13       NaN       NaN       NaN  NaN  NaN
2018-02-14       NaN       NaN       NaN  NaN  NaN
2018-02-15  1.160203 -0.650070 -2.613977  4.0  2.0
2018-02-16 -3.018225 -1.370723 -3.888395  3.0  2.0
2018-02-17 -4.096299 -0.907763 -2.719749  2.0  2.0
2018-02-18       NaN       NaN       NaN  NaN  NaN
2018-02-19       NaN       NaN       NaN  NaN  NaN

In [96]:
print(df)
df.apply(np.cumsum)

                   A         B         C  D  E
2018-02-13  0.000000  1.000000 -1.045282  5  1
2018-02-14 -0.494383 -1.812418  0.392011  5  2
2018-02-15  2.160203  0.349930 -1.613977  5  3
2018-02-16 -1.018225  0.629277 -1.888395  5  4
2018-02-17 -1.096299  2.092237  0.280251  5  5
2018-02-18  0.513296 -0.625118  0.000796  5  6
2018-02-19 -1.349954  0.638369 -0.632032  5  7

                   A         B         C   D   E
2018-02-13  0.000000  1.000000 -1.045282   5   1
2018-02-14 -0.494383 -0.812418 -0.653271  10   3
2018-02-15  1.665820 -0.462488 -2.267248  15   6
2018-02-16  0.647595  0.166789 -4.155643  20  10
2018-02-17 -0.448704  2.259025 -3.875392  25  15
2018-02-18  0.064592  1.633907 -3.874595  30  21
2018-02-19 -1.285362  2.272276 -4.506627  35  28

In [97]:
df.apply(lambda x: x.max() - x.min())

A    3.510158
B    3.904655
C    2.280405
D    0.000000
E    6.000000
dtype: float64

# Concat

In [98]:
df = pd.DataFrame(np.random.randn(10,4))
df

          0         1         2         3
0  1.084545 -2.403657  0.904703  0.935637
1  0.360127 -1.630859  0.749268 -0.347847
2  1.653550 -0.722811  1.327546  0.528491
3 -0.376592 -0.112376 -0.747546  1.211231
4  0.268626 -0.100295  0.761426 -0.046743
5  0.919460  1.297227  2.065912  1.137375
6 -0.728407 -1.611232 -1.050111  0.839105
7 -0.014298 -0.642957  1.173830  0.278346
8 -0.120057  0.007575  1.051635 -1.821874
9 -0.354851  0.166848  0.711676  0.507953

In [99]:
df1 = df[:3]
df1

          0         1         2         3
0  1.084545 -2.403657  0.904703  0.935637
1  0.360127 -1.630859  0.749268 -0.347847
2  1.653550 -0.722811  1.327546  0.528491

In [101]:
df2 = df[3:7]
df2

          0         1         2         3
3 -0.376592 -0.112376 -0.747546  1.211231
4  0.268626 -0.100295  0.761426 -0.046743
5  0.919460  1.297227  2.065912  1.137375
6 -0.728407 -1.611232 -1.050111  0.839105

In [102]:
df3 = df[7:]
df3

          0         1         2         3
7 -0.014298 -0.642957  1.173830  0.278346
8 -0.120057  0.007575  1.051635 -1.821874
9 -0.354851  0.166848  0.711676  0.507953

In [104]:
pd.concat([df1, df2, df3])

          0         1         2         3
0  1.084545 -2.403657  0.904703  0.935637
1  0.360127 -1.630859  0.749268 -0.347847
2  1.653550 -0.722811  1.327546  0.528491
3 -0.376592 -0.112376 -0.747546  1.211231
4  0.268626 -0.100295  0.761426 -0.046743
5  0.919460  1.297227  2.065912  1.137375
6 -0.728407 -1.611232 -1.050111  0.839105
7 -0.014298 -0.642957  1.173830  0.278346
8 -0.120057  0.007575  1.051635 -1.821874
9 -0.354851  0.166848  0.711676  0.507953

# Join

In [106]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval':[1,2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})
print('Left\n',left)
print('\nRight\n',right)

Left
    key  lval
0  foo     1
1  foo     2

Right
    key  rval
0  foo     4
1  foo     5

In [107]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [3]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4,5]})
print('Left\n', left)
print('\nRight\n', right)

Left
    key  lval
0  foo     1
1  bar     2

Right
    key  rval
0  foo     4
1  bar     5

In [4]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

Append rows to exisiting dataframe

In [5]:
df = pd.DataFrame(np.random.randn(7,4), columns=list('ABCD'))
df

          A         B         C         D
0  0.085105 -0.605418 -0.274850 -0.152580
1 -0.210166  0.245868  0.046894  0.579421
2 -0.698051  0.588436 -2.325445  0.750735
3  0.907673 -0.188016  0.505402 -0.470826
4  0.498771  0.181565 -1.166746 -1.312376
5  0.701405  0.560732 -0.130521  0.258146
6  0.145512 -0.118527  0.401808  0.140135

In [6]:
s = df.iloc[3]
s

A    0.907673
B   -0.188016
C    0.505402
D   -0.470826
Name: 3, dtype: float64

In [7]:
df.append(s, ignore_index=True)

          A         B         C         D
0  0.085105 -0.605418 -0.274850 -0.152580
1 -0.210166  0.245868  0.046894  0.579421
2 -0.698051  0.588436 -2.325445  0.750735
3  0.907673 -0.188016  0.505402 -0.470826
4  0.498771  0.181565 -1.166746 -1.312376
5  0.701405  0.560732 -0.130521  0.258146
6  0.145512 -0.118527  0.401808  0.140135
7  0.907673 -0.188016  0.505402 -0.470826

In [8]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
                         'foo', 'bar', 'foo', 'bar'],
                   'B': ['one', 'one', 'two', 'three',
                         'two', 'two', 'one', 'three'],
                   'C': np.random.randn(8),
                   'D': np.random.randn(8)
                  })
df

     A      B         C         D
0  foo    one  1.050409 -0.621291
1  bar    one -2.355787  2.846220
2  foo    two -0.698834 -1.448198
3  bar  three -0.019282  2.578626
4  foo    two -2.252986  0.384233
5  bar    two  1.134335 -1.851623
6  foo    one -0.224389  0.273348
7  bar  three  1.198939 -0.004568

In [10]:
df.groupby('A').sum()

            C         D
A
bar -0.041796  3.568656
foo -2.125800 -1.411908

In [11]:
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one   -2.355787  2.846220
    three  1.179657  2.574059
    two    1.134335 -1.851623
foo one    0.826020 -0.347943
    two   -2.951820 -1.063965

# Reshaping

In [18]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                'foo', 'foo', 'qux', 'qux'],
                ['one', 'two', 'one', 'two',
                'one', 'two', 'one', 'two']]))
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [19]:
index = pd.MultiIndex.from_tuples(tuples, names=['First', 'Second'])
index

MultiIndex(levels=[['bar', 'baz', 'foo', 'qux'], ['one', 'two']],
           labels=[[0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 0, 1, 0, 1, 0, 1]],
           names=['First', 'Second'])

In [23]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])
df

                     A         B
First Second
bar   one     0.189276  0.514323
      two    -0.184151  2.092713
baz   one    -0.436843  0.722168
      two     0.601511  1.567411
foo   one     0.471686  1.128207
      two    -0.568618 -0.651124
qux   one    -0.740108  0.181559
      two     0.422298 -1.156722

In [24]:
df2 = df[:4]
df2

                     A         B
First Second
bar   one     0.189276  0.514323
      two    -0.184151  2.092713
baz   one    -0.436843  0.722168
      two     0.601511  1.567411

'stack()' method compresses the levels in the dataframe columns

In [25]:
stacked = df2.stack()
stacked

First  Second
bar    one     A    0.189276
               B    0.514323
       two     A   -0.184151
               B    2.092713
baz    one     A   -0.436843
               B    0.722168
       two     A    0.601511
               B    1.567411
dtype: float64

In [26]:
stacked.unstack()

                     A         B
First Second
bar   one     0.189276  0.514323
      two    -0.184151  2.092713
baz   one    -0.436843  0.722168
      two     0.601511  1.567411

In [29]:
df2.unstack()

               A                   B
Second       one       two       one       two
First
bar     0.189276 -0.184151  0.514323  2.092713
baz    -0.436843  0.601511  0.722168  1.567411

# Pivot Tables

In [30]:
df = pd.DataFrame({'A': ['one', 'one', 'two', 'three'] * 3,
                   'B': ['A', 'B', 'C'] * 4,
                   'C': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                   'D': np.random.randn(12),
                   'E': np.random.randn(12)})
df

        A  B    C         D         E
0     one  A  foo  0.734577 -1.112111
1     one  B  foo  0.049856  1.030502
2     two  C  foo  0.963918 -1.662785
3   three  A  bar  1.401983 -0.075771
4     one  B  bar  0.809907 -0.063335
5     one  C  bar -1.194609 -0.503737
6     two  A  foo  0.346277  1.779752
7   three  B  foo  0.731936  0.841142
8     one  C  foo -1.158277 -0.300127
9     one  A  bar  0.579848 -0.185507
10    two  B  bar -1.922624 -0.827369
11  three  C  bar -0.344693 -0.466597

In [31]:
pd.pivot_table(df, values='D', columns='C', index=['A', 'B'])

C             bar       foo
A     B
one   A  0.579848  0.734577
      B  0.809907  0.049856
      C -1.194609 -1.158277
three A  1.401983       NaN
      B       NaN  0.731936
      C -0.344693       NaN
two   A       NaN  0.346277
      B -1.922624       NaN
      C       NaN  0.963918

# Time Series Data

In [38]:
rng = pd.date_range('1/1/2018', periods=100, freq='s')
rng

DatetimeIndex(['2018-01-01 00:00:00', '2018-01-01 00:00:01',
               '2018-01-01 00:00:02', '2018-01-01 00:00:03',
               '2018-01-01 00:00:04', '2018-01-01 00:00:05',
               '2018-01-01 00:00:06', '2018-01-01 00:00:07',
               '2018-01-01 00:00:08', '2018-01-01 00:00:09',
               '2018-01-01 00:00:10', '2018-01-01 00:00:11',
               '2018-01-01 00:00:12', '2018-01-01 00:00:13',
               '2018-01-01 00:00:14', '2018-01-01 00:00:15',
               '2018-01-01 00:00:16', '2018-01-01 00:00:17',
               '2018-01-01 00:00:18', '2018-01-01 00:00:19',
               '2018-01-01 00:00:20', '2018-01-01 00:00:21',
               '2018-01-01 00:00:22', '2018-01-01 00:00:23',
               '2018-01-01 00:00:24', '2018-01-01 00:00:25',
               '2018-01-01 00:00:26', '2018-01-01 00:00:27',
               '2018-01-01 00:00:28', '2018-01-01 00:00:29',
               '2018-01-01 00:00:30', '2018-01-01 00:00:31',
               '2018-01-01 00:00:32', '2018-01-01 00:00:33',
               '2018-01-01 00:00:34', '2018-01-01 00:00:35',
               '2018-01-01 00:00:36', '2018-01-01 00:00:37',
               '2018-01-01 00:00:38', '2018-01-01 00:00:39',
               '2018-01-01 00:00:40', '2018-01-01 00:00:41',
               '2018-01-01 00:00:42', '2018-01-01 00:00:43',
               '2018-01-01 00:00:44', '2018-01-01 00:00:45',
               '2018-01-01 00:00:46', '2018-01-01 00:00:47',
               '2018-01-01 00:00:48', '2018-01-01 00:00:49',
               '2018-01-01 00:00:50', '2018-01-01 00:00:51',
               '2018-01-01 00:00:52', '2018-01-01 00:00:53',
               '2018-01-01 00:00:54', '2018-01-01 00:00:55',
               '2018-01-01 00:00:56', '2018-01-01 00:00:57',
               '2018-01-01 00:00:58', '2018-01-01 00:00:59',
               '2018-01-01 00:01:00', '2018-01-01 00:01:01',
               '2018-01-01 00:01:02', '2018-01-01 00:01:03',
               '2018-01-01 00:01:04', '2018-01-01 00:01:05',
               '2018-01-01 00:01:06', '2018-01-01 00:01:07',
               '2018-01-01 00:01:08', '2018-01-01 00:01:09',
               '2018-01-01 00:01:10', '2018-01-01 00:01:11',
               '2018-01-01 00:01:12', '2018-01-01 00:01:13',
               '2018-01-01 00:01:14', '2018-01-01 00:01:15',
               '2018-01-01 00:01:16', '2018-01-01 00:01:17',
               '2018-01-01 00:01:18', '2018-01-01 00:01:19',
               '2018-01-01 00:01:20', '2018-01-01 00:01:21',
               '2018-01-01 00:01:22', '2018-01-01 00:01:23',
               '2018-01-01 00:01:24', '2018-01-01 00:01:25',
               '2018-01-01 00:01:26', '2018-01-01 00:01:27',
               '2018-01-01 00:01:28', '2018-01-01 00:01:29',
               '2018-01-01 00:01:30', '2018-01-01 00:01:31',
               '2018-01-01 00:01:32', '2018-01-01 00:01:33',
               '2018-01-01 00:01:34', '2018-01-01 00:01:35',
               '2018-01-01 00:01:36', '2018-01-01 00:01:37',
               '2018-01-01 00:01:38', '2018-01-01 00:01:39'],
              dtype='datetime64[ns]', freq='S')

In [39]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)
ts

2018-01-01 00:00:00    253
2018-01-01 00:00:01    406
2018-01-01 00:00:02    261
2018-01-01 00:00:03    130
2018-01-01 00:00:04    227
2018-01-01 00:00:05    356
2018-01-01 00:00:06    157
2018-01-01 00:00:07     24
2018-01-01 00:00:08    116
2018-01-01 00:00:09    408
2018-01-01 00:00:10     61
2018-01-01 00:00:11    491
2018-01-01 00:00:12    211
2018-01-01 00:00:13    231
2018-01-01 00:00:14    442
2018-01-01 00:00:15    464
2018-01-01 00:00:16    132
2018-01-01 00:00:17    357
2018-01-01 00:00:18    163
2018-01-01 00:00:19    158
2018-01-01 00:00:20    150
2018-01-01 00:00:21     65
2018-01-01 00:00:22     63
2018-01-01 00:00:23    249
2018-01-01 00:00:24     50
2018-01-01 00:00:25     14
2018-01-01 00:00:26    174
2018-01-01 00:00:27    361
2018-01-01 00:00:28    234
2018-01-01 00:00:29    263
                      ...
2018-01-01 00:01:10     50
2018-01-01 00:01:11     12
2018-01-01 00:01:12     62
2018-01-01 00:01:13    462
2018-01-01 00:01:14    131
2018-01-01 00:01:15    249
2018-01-01 00:01:16    381
2018-01-01 00:01:17    491
2018-01-01 00:01:18    321
2018-01-01 00:01:19    150
2018-01-01 00:01:20    414
2018-01-01 00:01:21     68
2018-01-01 00:01:22    196
2018-01-01 00:01:23    390
2018-01-01 00:01:24    429
2018-01-01 00:01:25    365
2018-01-01 00:01:26     54
2018-01-01 00:01:27    482
2018-01-01 00:01:28    298
2018-01-01 00:01:29    231
2018-01-01 00:01:30    499
2018-01-01 00:01:31    334
2018-01-01 00:01:32    449
2018-01-01 00:01:33    429
2018-01-01 00:01:34     18
2018-01-01 00:01:35    100
2018-01-01 00:01:36     35
2018-01-01 00:01:37    431
2018-01-01 00:01:38    353
2018-01-01 00:01:39    308
Freq: S, Length: 100, dtype: int32

In [41]:
ts.resample('5Min').sum()

2018-01-01    23524
Freq: 5T, dtype: int32

In [42]:
rng = pd.date_range('2018-01-01 00:00', periods=5, freq='D')
rng

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05'],
              dtype='datetime64[ns]', freq='D')

In [45]:
ts = pd.Series(np.random.randn(len(rng)), rng)
ts

2018-01-01    0.468789
2018-01-02   -0.697146
2018-01-03    1.226983
2018-01-04   -0.792174
2018-01-05   -0.938767
Freq: D, dtype: float64

In [46]:
ts_gmt = ts.tz_localize('GMT')
ts_gmt

2018-01-01 00:00:00+00:00    0.468789
2018-01-02 00:00:00+00:00   -0.697146
2018-01-03 00:00:00+00:00    1.226983
2018-01-04 00:00:00+00:00   -0.792174
2018-01-05 00:00:00+00:00   -0.938767
Freq: D, dtype: float64

In [48]:
ts_gmt.tz_convert('US/Eastern')

2017-12-31 19:00:00-05:00    0.468789
2018-01-01 19:00:00-05:00   -0.697146
2018-01-02 19:00:00-05:00    1.226983
2018-01-03 19:00:00-05:00   -0.792174
2018-01-04 19:00:00-05:00   -0.938767
Freq: D, dtype: float64

# Categorical

In [50]:
df =  pd.DataFrame({'id':[1,2,3,4,5,6], 'names': ['a', 'b', 'c',' d', 'a', 'b']})
df

   id names
0   1     a
1   2     b
2   3     c
3   4     d
4   5     a
5   6     b

In [65]:
df['Grade'] = df['names'].astype('category')
df['Grade']

0     a
1     b
2     c
3     d
4     a
5     b
Name: Grade, dtype: category
Categories (4, object): [d, a, b, c]

In [66]:
df['Grade'].cat.categories = ['Very Good', 'Good', 'Poor', 'Very Poor']
df

   id names      Grade
0   1     a       Good
1   2     b       Poor
2   3     c  Very Poor
3   4     d  Very Good
4   5     a       Good
5   6     b       Poor

In [67]:
df.sort_values(by='Grade')

   id names      Grade
3   4     d  Very Good
0   1     a       Good
4   5     a       Good
1   2     b       Poor
5   6     b       Poor
2   3     c  Very Poor

In [68]:
df.groupby(by='Grade').size()

Grade
Very Good    1
Good         2
Poor         2
Very Poor    1
dtype: int64